Repository: ammonkey/marlin
Catalog: po/*.po
Languages: si

source: Location
si: පිහිටුම

source: Target
si: ඉලක්කය

source: Origin Location
si: මුල් පිහිටුම

source: Other application...
si: වෙනත් යෙදුම්...

source: Open with
si: සමග විවෘත කරන්න

source: Read
si: කියවීම

source: Write
si: ලිවීම

source: Execute
si: ක්‍රියාකරවන්න

source: Owner
si: හිමිකරු

source: Group
si: කණ්ඩායම

source: Everyone
si: හැම දෙනාම

source: Select an aplication to open
si: විවෘත කිරීමට යෙදුමක් තෝරාගන්න

source: Name
si: නම

source: Type
si: වර්ගය

source: Size
si: ප්‍රමාණය

source: Folder does not exist
si: ෆොල්ඩරය නොපවතී

source: Marlin can't find the folder %s
si: marlin හට ෆොල්ඩරය සොයා ගත නොහැක %s

source: Create
si: නිර්මාණය කරන්න

source: Create the folder %s
si: ෆොල්ඩරය නිර්මාණය කරන්න %s

source: Marlin Preferences
si: marlinහි අභිප්‍රාය

source: Single click to open:
si: විවෘත කිරීමට තනි ක්ලිකය:

source: Mouse auto-selection speed:
si: මූසිකයෙහි ස්වයං තෝරාගැනීමේ වේගය :

source: Properties Dialog set modal:
si: දෙබසේ ගුණාංග අනුකෘතියක් පිහිටුවයි:

source: Default File Manager:
si: පෙරනිමිය ගොනු කළමනාකරු:

source: Behavior
si: හැසිරිම

source: small
si: කුඩා

source: medium
si: මධ්‍යම

source: large
si: විශාල

source: extra-large
si: අධික විශාල

source: Sidebar icon size:
si: පැති තීරුවේ නිරුපක විශාලත්වය

source: locale
si: පෙදෙසිය

source: informal
si: අවිධිමත්

source: Date format:
si: දින අකෘතිය

source: Display
si: සංදර්ශනය කරන්න

source: Extensions
si: විස්තීරණයන්

source: Trash
si: ඉවතලන බහලුම

source: Network
si: ජාලය

source: Home
si: නිවහන

source: File System
si: ගොනු පද්ධතිය

source: Single Click
si: තනි ක්ලිකය

source: Whether the items in the view can be activated with single clicks
si: දර්ශනය වන අයිතමයන් තනි ක්ලිකයෙන් ස්ක්‍රිය විය හැක.

source: Single Click Timeout
si: තනි ක්ලිකයේ කාලය වැයවීම

source: The amount of time after which the item under the mouse cursor will be selected automatically in single click mode
si: තනි ක්ලිකයට මුසිකය යට ඇති අයිතමය ස්වයංක්‍රීයව තෝරාගැනීම සදහා කොපමණ වෙලාවක් යන්නේද

source: Public FTP
si: මහජන FTP

source: FTP (with login)
si: FTP (පිවිසීමක් සමඟ)

source: Windows share
si: කවුළු හුවමාරුව

source: Secure WebDAV (HTTPS)
si: ආරක්ෂිත WebDAV (HTTPS)

source: Connecting...
si: සම්බන්ධ වෙමින්...

source: Can't load the supported server method list. Please check your gvfs installation.
si: සහයෝගය දෙන විධික්‍රමය සහිත සේවදායක ප්‍රවේශනය කිරීමට නොපුලුවන. කරුණාකර gvfs ස්ථාපනය කිරීම පරීක්ෂා කර බලන්න.

source: The folder "%s" cannot be opened on "%s".
si: "%s" ෆොල්ඩරය "%s" මගින් විවෘත කල නොහැක

source: The server at "%s" cannot be found.
si: සේවාදායකයාගේ "%s" සොයා ගත නොහැක

source: Try Again
si: නැවත උත්සාහ කරන්න

source: Please verify your user details.
si: කරුණාකර ඔබගේ තොරතුරු නිවරදිද පරීක්ෂා කරන්න

source: Continue
si: පවත්වාගෙන යන්න

source: C_onnect
si: සම්බන්ධ (_o)

source: Connect to Server
si: සේවාදායකයට සම්බන්ද වන්න

source: Server Details
si: සේවාදායකයාගේ තොරතුරු

source: _Server:
si: සේවාදායකය(_S):

source: _Port:
si: පේනුව(_P):

source: _Type:
si: වර්ගය (_T):

source: Sh_are:
si: බෙදාහදාලන්න (_a):

source: _Folder:
si: බහලුම (_F):

source: User Details
si: පරිශීලක තොරතුරු

source: _Domain name:
si: කළාප නම (_D):

source: Pass_word:
si: මුරපදය (_W):

source: _Remember this password
si: මෙම රහස් පදය මතක තබා ගන්න (_R)

source: Operation cancelled
si: මෙහෙයුම අහෝසියි

source: Compact directory listing
si: සංගත ගොනු ලැයිස්තුගත කිරීම

source: Compact view
si: ගොනු දක්වනය

source: This folder is empty.
si: මෙම බහාළුම හිස්.

source: Failed to rename %s to %s
si: %s, %sබවට නැවත නාමකරණය කිරීමට අසමත් විය

source: _Move Here
si: මෙතනට ගෙනියන්න (_M)

source: _Copy Here
si: මෙතනට පිටපත් කරන්න (_C)

source: _Link Here
si: මෙතනට පුරුකක් සකසන්න (_L)

source: Set as _Background
si: පසුබිම ලෙස සකසන්න (_B)

source: Cancel
si: අවලංගු කරන්න

source: Failed to execute file "%s"
si: %s ක්‍රියකරවන ගොනුව අසමත් විය

source: Icon directory listing
si: නිරූපක නමාවලිය

source: Icon view
si: නිරූපකය දර්ශනය

source: Customize Toolbar
si: අභිරුචිකරණය කල මෙවලම් තීරුව

source: Select items to be displayed on the toolbar. Items can be reordered by drag and drop.
si: තොරගත් අයිතමයන් මෙවලම් තීරුවෙහි දැක්විය. අයිතමයන්ට ඇදීම හා හෙලුම මගින් නැවත සකස්වෙයි

source: Available Items
si: ප්‍රයෝජ්‍ය අයිතමයන්

source: Displayed Items
si: සංදර්ශක අයිතමයන්

source: Personal
si: පුද්ගලික

source: Your common places and bookmarks
si: පොදු ස්ථාන හා පිටුසනයන්

source: Open your personal folder
si: ඔබගේ පෞද්ගලික බහලුම් විවෘත කරන්න

source: Open the trash
si: බහලුම විවෘත කරන්න

source: Devices
si: උපාංග

source: Your local partitions and devices
si: ඔබගේ ස්ථානීය පංගු සහ ආම්පන්න

source: Open the contents of the File System
si: ගොනු පද්ධතියෙහි අන්තර්ගතය විවෘත කරන්න

source: Mount and open %s
si: %s නංවනවා සහ විවෘත කරනවා

source: Your network places
si: ඔබේ ජාලය පිහිටුවනවා

source: Entire network
si: සමස්ත ජාලය

source: Browse the contents of the network
si: ජාල අන්තර්ගතය පිරික්සීම

source: _Start
si: ආරම්භ කරන්න (_S)

source: _Stop
si: නතර කරන්න (_S)

source: _Power On
si: බලය අරම්භය(_p)

source: _Safely Remove Drive
si: ධාවකය ආරක්ෂිතව ඉවත් කරනවා (_S)

source: _Connect Drive
si: ධාවකය සම්බන්ධ කරනවා (_C)

source: _Disconnect Drive
si: ධාවකය විසන්ධි කරනවා (_D)

source: _Start Multi-disk Device
si: බොහෝ-තැටි ආම්පන්න ආරම්භ කරනවා (_S)

source: _Stop Multi-disk Device
si: බොහෝ-තැටි ආම්පන්න නතර කරනවා (_S)

source: _Unlock Drive
si: අගුල් හැර ආම්පන්න මුදා හරිනවා (_U)

source: _Lock Drive
si: ආම්පන්නයන්හි අගුල් දමනවා

source: Unable to start %s
si: %s ආරම්භ කරන්න අසමත් විය

source: Unable to eject %s
si: %s ප්‍රතික්ෂේප කරන්න අසමත් විය

source: Unable to poll %s for media changes
si: %s මාධ්‍යය වෙනස්වීමට ඡන්දය දීමට අසමත් විය

source: Unable to stop %s
si: %s නැවැත්වීමට අසමත් විය

source: _Open
si: විවෘත කරන්න (_O)

source: Open in New _Tab
si: නව පටිත්තක් විවෘත කරන්න (_T)

source: Open in New _Window
si: නව කවුළුවක විවෘත කරන්න (_W)

source: Remove
si: ඉවත්කරන්න

source: Rename...
si: නැවත නාමකරණය...

source: _Mount
si: ස්ඵාපනය (_M)

source: _Unmount
si: අස්ථාපනය (_U)

source: _Eject
si: ඉවත් කරන්න (_E)

source: Empty _Trash
si: ඉවතලන බහලුම හිස් කරන්න (_T)

source: Icon Size
si: නිරූපක ප්‍රමාණය

source: Icon size
si: නිරූපකයේ ප්‍රමාණය

source: Invalid filename provided by XDS drag site
si: XDS අදුම් අඩවිය විසින් අවලංගු ගොනුනාම සැපයුම සිදු විය

source: Failed to create a link for the URL "%s"
si: "%s" URL අමුණුම සදහා සිදුකල නිර්මාණය අසමත් විය

source: Use "%s" to open the selected item
si: තොරාගත් අයිතමය විවෘත කිරීමට "%s" භාවිතා කරන්න

source: _Open With %s
si: %s සමග විවෘත කරන්න(_O)

source: Open in %'d New _Tabs
si: %'d සමග නව-පටිත්තක් විවෘත කරන්න(_T)

source: Open in %'d New _Windows
si: %'d සමග නව-කවුළුවක් විවෘත කරන්න(_W)

source: Set as default
si: පෙරනිමිය ලෙස සකස් කරන්න

source: Set Color:
si: පාට සූදානම් කරනවා:

source: There is nothing on the clipboard to paste
si: ක්ලිප්පුවරුවෙහි කිසිම ඇලවීමක් නොමැත

source: File Operations
si: ගොනු මෙහෙයවීම

source: Show Details
si: තොරතුරු පෙන්වන්න

source: %'d file operation active
si: %'d ගොනු මෙහෙයවීම ක්‍රියශීලියි

source: Show copy dialog
si: දෙබස් පිටපත් පෙන්වනවා

source: Cancel all in-progress actions
si: සියලුම දියණුවෙමින් පවතින ක්‍රියවලි අවලංගු කරන්න

source: All file operations have been successfully completed
si: සියලුම ගොනු ක්‍රියවලීන් සාර්ථකව සම්පූර්ණ විය

source: Select All
si: සියල්ල තෝරන්න

source: Input Methods
si: ඇතුලත් කරන ක්‍රම

source: Layout mode
si: පිරිසැලසුම් ආකාරය

source: The layout mode
si: පිරිසැලසුම් ආකාරය

source: Browse the file system with the file manager
si: ගොනු පද්ධතිය කළමණාකරු සමඟ ගවේශනය කරන්න

source: --quit cannot be used with URIs.
si: --URI සමග quit භවිතා කිරීමට නුපුලුවන.

source: Preparing
si: සූදානම් කරමින්

source: (invalid Unicode)
si: (සාවද්‍ය යුනිකේතය)

source: _Skip
si: මගහරින්න (_S)

source: S_kip All
si: සියල්ල මගහරින්න (_k)

source: _Retry
si: නැවත උත්සාහ කරන්න (_R)

source: Delete _All
si: සියල්ල මකන්න(_A)

source: _Replace
si: ප්‍රතිස්ථාපනය කරන්න (_R)

source: Replace _All
si: සියල්ල ප්‍රතිස්ථාපනය කරන්න(_A)

source: _Merge
si: සංයුක්ත කරන්න(_M)

source: Merge _All
si: සියල්ල සංයුක්ත කරන්න(_A)

source: Copy _Anyway
si: කෙසේ හෝ පිටපත් කරන්න(_A)

source: %'d second
si: තත්පර %'d

source: %'d minute
si: මිනිත්තු %'d

source: %'d hour
si: පැය %'d

source: approximately %'d hour
si: ආසන්න වශයෙන් පැය %'d

source: Link to %s
si: %s අමුණුම

source: Another link to %s
si: %s වෙත තවත් ඇමුණුමක්

source: %'dst link to %s
si: %'dst ඇමුණුමක් %s

source: %'dnd link to %s
si: %'dnd ඇමුණුමක් %s

source: %'drd link to %s
si: %'drd ඇමුණුමක් %s

source: %'dth link to %s
si: %'dth ඇමුණුමක් %s

source: Are you sure you want to permanently delete "%B" from the trash?
si: "%B" ඔබට නිසැකයෙන්ම බහලුමෙහි ඇති ස්ථිර ගොනුව අවලංගු කල යුතුයිද ?

source: Are you sure you want to permanently delete the %'d selected item from the trash?
si: ඔබට නිසැකයෙන්ම බහලුමෙහි ඇති %'d ස්ථිර තොරාගත් අයිතමය අවලංගු කල යුතුයිද

source: If you delete an item, it will be permanently lost.
si: ඔබ අයිතමයක් මැකුවහොත් එය ස්ථිරවම නැතිවනු ඇත.

source: Empty all items from Trash?
si: බහලුමෙන් සියලුම අයිතමයන් ඉවත් කරන්න

source: All items in the Trash will be permanently deleted.
si: බහලුමෙන් සියලුම අයිතමයන් ඉවත් කරාවි

source: Are you sure you want to permanently delete "%B"?
si: බහලුමෙන් සියලුම "%B" නිසැකවම මැකීම අවශ්‍යද

source: Are you sure you want to permanently delete the %'d selected item?
si: බහලුමෙන් සියලුම %'d තොරාගත් අයිතමය නිසැකවම මැකීම අවශ්‍යද?

source: Deleting files
si: ගොනු මකමින්

source: %'d file left to delete
si: %'d ගොනුව වමට මැකීම

source: %T left
si: %T වමට

source: Error while deleting.
si: මැකීමේදී දෝෂයකි.

source: Files in the folder "%B" cannot be deleted because you do not have permissions to see them.
si: ෆොල්ඩරයෙහි "%B" හි ඇති ගොනු මැකිය නොහැක,ඔබට එවා බැලීම සදහා අවසරය නොමැති හෙතුවෙන්

source: There was an error getting information about the files in the folder "%B".
si: ෆොල්ඩරයෙහි බ් ගෙන් එහි ගොනු පිලිබද තොරතුරු ගැනීමෙදී දෝශයක් ඇතිවේ.

source: _Skip files
si: මඟහරින ගොනුව(_S)

source: The folder "%B" cannot be deleted because you do not have permissions to read it.
si: ෆොල්ඩරය "%B" මැකිය නොහැක,ඔබට එය කියවීමට අවසර ලබා දී නැත.

source: There was an error reading the folder "%B".
si: ෆොල්ඩරය "%B" කියවීමේදී දොශයක් ඇත

source: Could not remove the folder %B.
si: %B ෆොල්ඩරය ඉවත් කල නොහැක

source: There was an error deleting %B.
si: %B ෆොල්ඩරය මැකීමේ දොශයක් ඇත.

source: Moving files to trash
si: බහලුම දක්වා ගොනු එහා මෙහා කරනවා

source: %'d file left to trash
si: %'d ගොනුව බහාලුම හැර යනවා

source: Cannot move file to trash, do you want to delete immediately?
si: ගොනු බහාලුමට යැවිය නොහැක,ඔබට ඉතාම ඉක්මනින් මැකීමට අවශ්‍යද?

source: The file "%B" cannot be moved to the trash.
si: "%B" ගොනුව බහාලුමට යැවිය නොහැක.

source: Trashing Files
si: බහාලුම් ගොනු

source: Deleting Files
si: ගොනු මැකීම

source: Unable to eject %V
si: %V ස්ථාපිත කිරීමේ අසමර්ථය

source: Unable to unmount %V
si: %V ප්‍රතික්ෂේප නොකිරීමේ අසමර්ථය

source: Do you want to empty the trash before you unmount?
si: ස්ථාපිත නොකිරීමට පෙර ඔබට බහාලුම හිස් කිරීමට අවශ්‍යද?

source: In order to regain the free space on this volume the trash must be emptied. All trashed items on the volume will be permanently lost.
si: ඊට අමතරව නිදහස් ඉඩකඩ ප්‍රමණය නැවත ලබාගැනීම සදහා බහාලුම හිස් විය යුතුයි. හැම බහලුමකම ඇති අයිතමයක්ම ස්ථිරවම නැති විය හැක

source: Do _not Empty Trash
si: බහාලුම හිස් නොකරන්න(_n)

source: Emptying the trash
si: බහාලුම හිස් කරමින්

source: Unable to mount %s
si: %s ස්ථාපිත කල නොහැක

source: Preparing to copy %'d file (%S)
si: %'d ගොනුව පිටපත් කිරීමට සුදානම් වීම (%S)

source: Preparing to move %'d file (%S)
si: %'d ගොනුව එහා මෙහා කිරීමට සුදානම් වීම (%S)

source: Preparing to delete %'d file (%S)
si: %'d ගොනුව මකා දැමීමට සුදානම් වීම (%S)

source: Preparing to trash %'d file
si: %'dගොනුව බහාලුම් කිරීමට දැමීමට සුදානම් වීම

source: Error while copying.
si: පිටපත් කිරීමේදි දෝෂයකි.

source: Error while moving.
si: ගෙන යාමේදි දෝෂයකි.

source: Error while moving files to trash.
si: ගොනුව බහාලුමට රැගෙන යෑමේදි ඇති වන දෝශ

source: Files in the folder "%B" cannot be handled because you do not have permissions to see them.
si: "%B" ෆොල්ඩරය තුල ඇති ගොනු මෙහෙයවිය නොහැක, ඔබට අවසරය නෑ ගොනු නිරීක්ෂණයට

source: The folder "%B" cannot be handled because you do not have permissions to read it.
si: "%B" ෆොල්ඩරය මෙහෙයවිය නොහැක, ඔබට අවසරය නෑ ෆොල්ඩරය නිරීක්ෂණයට

source: The file "%B" cannot be handled because you do not have permissions to read it.
si: "%B" ගොනු මෙහෙයවිය නොහැක, ඔබට අවසරය නෑ ගොනු නිරීක්ෂණයට

source: There was an error getting information about "%B".
si: "%B" ගැන තොරතුරු දැන ගැනීමට දෝශයක් ඇත.

source: Error while copying to "%B".
si: "%B" පිටපත් කරන අතරතුර ඇතිවන දොශයන්

source: You do not have permissions to access the destination folder.
si: ඔබට ඉලක්ක ගොනුවට ප්‍රවෙශ වීමට අවසර නොමැත.

source: There was an error getting information about the destination.
si: ඉලක්කය පිලිබදව තොරතුරු ගැනීමේදී දොශයක් ඇත.

source: The destination is not a folder.
si: ඉලක්කය ෆොල්ඩරයක් නොවේ

source: There is not enough space on the destination. Try to remove files to make space.
si: ඉලක්කය තුල ප්‍රමණවත් හිඩැසක් නොමැත එම නිසා ගොනු මකා දැමිය යුතුනොවේ

source: There is %S available, but %S is required.
si: %S ලබාගත හැකිය, නමුත් %S අවශ්‍ය වේ.

source: The destination is read-only.
si: ඉලක්කය කියවීමට පමණයි

source: Moving "%B" to "%B"
si: චලනය වන්න "%B" සිට"%B"

source: Copying "%B" to "%B"
si: පිටපත් කිරීම "%B" සිට"%B"

source: Duplicating "%B"
si: "%B" ද්වීකරණය කිරීම

source: Moving %'d file (in "%B") to "%B"
si: %'d ගොනුව චලනය වන්න(තුළ "%B") සිට"%B"

source: Copying %'d file (in "%B") to "%B"
si: %'d ගොනුව පිටපත් කිරීම(තුළ"%B") සිට "%B"

source: Duplicating %'d file (in "%B")
si: %'d ගොනුව ද්වීකරණය කිරීම (තුළ"%B")

source: Moving %'d file to "%B"
si: %'d ගොනු චලනය වන්න තුළ"%B"

source: Copying %'d file to "%B"
si: %'d ගොනු පිටපත් කිරීම "%B"

source: Duplicating %'d file
si: %'d ගොනු ද්වීකරණය කිරීම

source: %S of %S
si: %S ගේ %S

source: %S of %S — %T left (%S/sec)
si: %S ගෙන් %S — %T වමට (%S/sec)

source: The folder "%B" cannot be copied because you do not have permissions to create it in the destination.
si: "%B" ෆොල්ඩරය පිටපත් කල නොහැක, ඔබට ඉලක්කයක් නිර්මාණය කිරීමට අවසර දී නොමැති නිසා.

source: There was an error creating the folder "%B".
si: "%B" ෆොල්ඩරය නිර්මාණය කිරීමෙදී දෝශ ඇතිවිය හැක.

source: Files in the folder "%B" cannot be copied because you do not have permissions to see them.
si: "%B" ෆොල්ඩරය ඇති ගොනු පිටපත් කල නොහැක,නිරීක්ෂණය කිරීමෙදී දෝශ ඇතිවිය හැක නිස අවසර දී නොමැත

source: The folder "%B" cannot be copied because you do not have permissions to read it.
si: "%B" ෆොල්ඩරය ඇති ගොනු පිටපත් කල නොහැක,කියවීමෙදී දෝශ ඇතිවිය හැකි නිසා අවසර දී නොමැත

source: Error while moving "%B".
si: "%B" චලනය වන අතරේදිත් දෝෂයක් ඇති විය හැක.

source: Could not remove the source folder.
si: මුලශ්‍ර ෆොල්ඩරය ඉවත් කල නොහැක

source: Error while copying "%B".
si: "%B"පිටපත් වන අතරේදිත් දෝෂයක් ඇති විය හැක.

source: Could not remove files from the already existing folder %F.
si: %F දැනට තියෙන ෆොල්ඩර් වලින් ගොනු චලනය නොකරන්න

source: Could not remove the already existing file %F.
si: දැනට තියෙන %F ගොනු චලනය නොකරන්න

source: You cannot move a folder into itself.
si: ෆොල්ඩරය තමන්විසින්ම චලනය කරන්න බෑ.

source: You cannot copy a folder into itself.
si: තමන්විසින්ම ෆොල්ඩරය පිටපත් කරන්න බෑ.

source: The destination folder is inside the source folder.
si: මුලශ්‍ර ෆොල්ඩරය යටතේ ඉලක්ක ෆොල්ඩර ඇත.

source: You cannot move a file over itself.
si: තමන් විසින්ම ගොනු යැවීමේ හැකියව නැත.

source: untitled folder
si: නිර්නාමික බහලුම

source: new file
si: නව ගොනුව

source: Size:
si: ප්‍රමාණය:

source: Type:
si: වර්ගය:

source: Last modified:
si: අවසාන වෙනස් කළ දිනය:

source: Reset
si: යළි සකසන්න

source: Replace
si: යළි පිහිටුවන්න

source: Show more _details
si: වැඩි විස්තර පෙන්වන්න (_d)

source: link to %s
si: %s වෙත ඇමුණුම

source: No Exec field specified
si: ක්‍රියාකරවීමේ ක්ෂේත්‍රය නිරූපණය කර නැත

source: No URL field specified
si: URL ක්ෂේත්‍රය නිරූපණය කර නැත

source: Invalid desktop file
si: අවලංගු වැඩතලය ගොනුව

source: Slashes are not allowed in filenames
si: දිගටි කැපුම් පහර‍ ගොනුනමට අදාල නැත

source: Toplevel files cannot be renamed
si: ඉහලමායිමේ ගොනු නැවත නමකරණය කල නොහැක

source: Go to %s
si: %s ට යන්න
